backend/app/controllers/letters_controller.rb

  def index
    letters = current_user.letters.order(created_at: :desc)

    Rails.logger.info letters.inspect

    render json: letters.map { |letter|
---
SELECT "letters".* FROM "letters" WHERE "letters"."user_id" = 12 ORDER BY "letters"."created_at" DESC

  def create
    letter = current_user.letters.new(letter_params)

    if letter.save
---
INSERT INTO "letters" ("content", "sender", "recipient", "deliver_at", "readable_at", "delivered", "user_id", "created_at", "updated_at") VALUES ('emprego chegouuu', 'eu', 'eu depois', '2026-04-03 00:00:00', '2026-04-03 00:00:00', NULL, 12, '2026-03-29 20:39:23.233136', '2026-03-29 20:39:23.233136') RETURNING "id"